src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cffbf533-11c6-4206-9b8b-f7355cb63fd8">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="245f870e-a53a-4d86-aa0a-c0c7709b8acb">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="476f6bfa-b10c-4e0f-8499-23c652715b3f">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="eca2b076-d218-4d1c-948b-7894edf9fa49">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="65c9754b-53f6-4616-a9d4-74826f7b0ced">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ax_АдаптацияИнтерфейса/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ИзменитьРеквизитыФормы(Форма, СтруктурыРеквизитовМассив) Экспорт 
	
	// ПримерИспользования
	//СтруктураРеквизитовМассив = Новый Массив;
	//СтруктураРеквизитовМассив.Добавить(
	//	Новый Структура (
	//		"Имя, Тип", 
	//		"СписокБригадиры", 
	//		ax_ДинамическоеФормированиеИнтерфейса.ОписаниеТипаТаблицаЗначений()));
	//СтруктураРеквизитовМассив.Добавить(
	//	Новый Структура (
	//		"Имя, Тип, Путь, Заголовок", 
	//		"Бригадир", 
	//		ax_ДинамическоеФормированиеИнтерфейса.ОписаниеТипаСправочник("Пользователи"),
	//		"СписокБригадиры", 
	//		"Бригадир"));
	//ax_АдаптацияИнтерфейса.ИзменитьРеквизитыФормы(ЭтотОбъект, СтруктурыРеквизитовМассив);
		
	Форма.ИзменитьРеквизиты(СформироватьДобавляемыеРеквизиты(СтруктурыРеквизитовМассив));
	
КонецПроцедуры		

Процедура ИнициализироватьСписокВыбораПолейФормы(ПоляФормы) Экспорт 
	
	РезультатыЗапросаБригадиры = ПолучитьРезультатыЗапросаБригадиры(Новый Запрос, ТекстЗапросаБригадиры());	
	Если РезультатыЗапросаБригадиры.Бригадиры.Пустой() Тогда 
		Возврат;	
	КонецЕсли;	
	БригадирыТаблица = РезультатыЗапросаБригадиры.Бригадиры.Выгрузить();		
	Для Каждого Поле Из ПоляФормы Цикл 
		Поле.СписокВыбора.ЗагрузитьЗначения(БригадирыТаблица.ВыгрузитьКолонку("Бригадир"));
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРезультатыЗапросаБригадиры(Запрос, ТекстЗапроса)
	
	ТекстыЗапроса = Новый СписокЗначений();
	ТекстыЗапроса.Добавить(ТекстЗапроса, "Бригадиры");	
	Возврат ОбщегоНазначенияУТ.ПолучитьРезультатыЗапроса(Запрос, ТекстыЗапроса);
	
КонецФункции

Функция ТекстЗапросаБригадиры()
	
	Возврат "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК ПользовательСсылка,
	|	Пользователи.Представление КАК Представление
	|ПОМЕСТИТЬ вт_ОтборДействительныхПользователей
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК ДополнительныеРеквизитыСсылка,
	|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование
	|ПОМЕСТИТЬ вт_ОтборПВХДополнительныеРеквизиты
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Наименование ПОДОБНО ""Бригадир""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка КАК ПользователиСсылка,
	|	ДополнительныеРеквизиты.Свойство КАК Свойство
	|ПОМЕСТИТЬ вт_ОтборПользователиБригадиры
	|ИЗ
	|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ОтборПВХДополнительныеРеквизиты КАК вт_ОтборПВХ
	|		ПО ДополнительныеРеквизиты.Свойство = вт_ОтборПВХ.ДополнительныеРеквизитыСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ОтборДействительныхПользователей.ПользовательСсылка КАК Бригадир,
	|	вт_ОтборДействительныхПользователей.Представление КАК БригадирПредставление
	|ИЗ
	|	вт_ОтборДействительныхПользователей КАК вт_ОтборДействительныхПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ОтборПользователиБригадиры КАК вт_ОтборПользователиБригадиры
	|		ПО вт_ОтборДействительныхПользователей.ПользовательСсылка = вт_ОтборПользователиБригадиры.ПользователиСсылка";	
	
КонецФункции

Функция СформироватьДобавляемыеРеквизиты(СтруктураРеквизитовМассив)
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Элемент Из СтруктураРеквизитовМассив Цикл 
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы(Элемент));
	КонецЦикла;
	Возврат ДобавляемыеРеквизиты;
	
КонецФункции

Функция НовыйРеквизитФормы(СтруктураРеквизита)
	
	Имя = ?(СтруктураРеквизита.Свойство("Имя"), СтруктураРеквизита.Имя, Неопределено);
	Тип = ?(СтруктураРеквизита.Свойство("Тип"), СтруктураРеквизита.Тип, Неопределено);
	Путь = ?(СтруктураРеквизита.Свойство("Путь"), СтруктураРеквизита.Путь, Неопределено);
	Заголовок = ?(СтруктураРеквизита.Свойство("Заголовок"), СтруктураРеквизита.Заголовок, Неопределено);
	Возврат Новый РеквизитФормы(Имя, Тип, Путь, Заголовок);	
	
КонецФункции

#КонецОбласти
